<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\District;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DistrictSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $districts = [
            [1, 3, 'Dhaka', 'ঢাকা', '23.7115253', '90.4111451', 0],
            [2, 3, 'Faridpur', 'ফরিদপুর', '23.6070822', '89.8429406', 0],
            [3, 3, 'Gazipur', 'গাজীপুর', '24.0022858', '90.4264283', 0],
            [4, 3, 'Gopalganj', 'গোপালগঞ্জ', '23.0050857', '89.8266059', 0],
            [5, 8, 'Jamalpur', 'জামালপুর', '24.937533', '89.937775', 0],
            [6, 3, 'Kishoreganj', 'কিশোরগঞ্জ', '24.444937', '90.776575', 0],
            [7, 3, 'Madaripur', 'মাদারীপুর', '23.164102', '90.1896805', 0],
            [8, 3, 'Manikganj', 'মানিকগঞ্জ', '23.8644', '90.0047', 0],
            [9, 3, 'Munshiganj', 'মুন্সিগঞ্জ', '23.5422', '90.5305', 0],
            [10, 8, 'Mymensingh', 'ময়মনসিংহ', '24.7471', '90.4203', 0],
            [11, 3, 'Narayanganj', 'নারায়াণগঞ্জ', '23.63366', '90.496482', 0],
            [12, 3, 'Narsingdi', 'নরসিংদী', '23.932233', '90.71541', 0],
            [13, 8, 'Netrokona', 'নেত্রকোণা', '24.870955', '90.727887', 0],
            [14, 3, 'Rajbari', 'রাজবাড়ি', '23.7574305', '89.6444665', 0],
            [15, 3, 'Shariatpur', 'শরীয়তপুর', '23.2423', '90.4348', 0],
            [16, 8, 'Sherpur', 'শেরপুর', '25.0204933', '90.0152966', 0],
            [17, 3, 'Tangail', 'টাঙ্গাইল', '24.2513', '89.9167', 0],
            [18, 5, 'Bogura', 'বগুড়া', '24.8465228', '89.377755', 0],
            [19, 5, 'Joypurhat', 'জয়পুরহাট', '25.0968', '89.0227', 0],
            [20, 5, 'Naogaon', 'নওগাঁ', '24.7936', '88.9318', 0],
            [21, 5, 'Natore', 'নাটোর', '24.420556', '89.000282', 0],
            [22, 5, 'Chapai Nawabganj', 'চাঁপাইনবাবগঞ্জ', '24.5965034', '88.2775122', 0],
            [23, 5, 'Pabna', 'পাবনা', '23.998524', '89.233645', 0],
            [24, 5, 'Rajshahi', 'রাজশাহী', '24.3745', '88.6042', 0],
            [25, 5, 'Sirajgonj', 'সিরাজগঞ্জ', '24.4533978', '89.7006815', 0],
            [26, 6, 'Dinajpur', 'দিনাজপুর', '25.6217061', '88.6354504', 0],
            [27, 6, 'Gaibandha', 'গাইবান্ধা', '25.328751', '89.528088', 0],
            [28, 6, 'Kurigram', 'কুড়িগ্রাম', '25.805445', '89.636174', 0],
            [29, 6, 'Lalmonirhat', 'লালমনিরহাট', '25.9923', '89.2847', 0],
            [30, 6, 'Nilphamari', 'নীলফামারী', '25.931794', '88.856006', 0],
            [31, 6, 'Panchagarh', 'পঞ্চগড়', '26.3411', '88.5541606', 0],
            [32, 6, 'Rangpur', 'রংপুর', '25.7558096', '89.244462', 0],
            [33, 6, 'Thakurgaon', 'ঠাকুরগাঁও', '26.0336945', '88.4616834', 0],
            [34, 1, 'Barguna', 'বরগুনা', '22.0953', '90.1121', 0],
            [35, 1, 'Barishal', 'বরিশাল', '22.7010', '90.3535', 0],
            [36, 1, 'Bhola', 'ভোলা', '22.685923', '90.648179', 0],
            [37, 1, 'Jhalokati', 'ঝালকাঠি', '22.6406', '90.1987', 0],
            [38, 1, 'Patuakhali', 'পটুয়াখালী', '22.3596316', '90.3298712', 0],
            [39, 1, 'Pirojpur', 'পিরোজপুর', '22.5841', '89.9720', 0],
            [40, 2, 'Bandarban', 'বান্দরবান', '22.1953275', '92.2183773', 0],
            [41, 2, 'Brahmanbaria', 'ব্রাহ্মণবাড়িয়া', '23.9570904', '91.1119286', 0],
            [42, 2, 'Chandpur', 'চাঁদপুর', '23.2332585', '90.6712912', 0],
            [43, 2, 'Chattogram', 'চট্টগ্রাম', '22.335109', '91.834073', 0],
            [44, 2, 'Cumilla', 'কুমিল্লা', '23.4682747', '91.1788135', 0],
            [45, 2, 'Cox\'s Bazar', 'কক্স বাজার', '21.4272', '92.0058', 0],
            [46, 2, 'Feni', 'ফেনী', '23.0159', '91.3976', 0],
            [47, 2, 'Khagrachari', 'খাগড়াছড়ি', '23.119285', '91.984663', 0],
            [48, 2, 'Lakshmipur', 'লক্ষ্মীপুর', '22.942477', '90.841184', 0],
            [49, 2, 'Noakhali', 'নোয়াখালী', '22.869563', '91.099398', 0],
            [50, 2, 'Rangamati', 'রাঙ্গামাটি', '22.7324', '92.2985', 0],
            [51, 7, 'Habiganj', 'হবিগঞ্জ', '24.374945', '91.41553', 0],
            [52, 7, 'Maulvibazar', 'মৌলভীবাজার', '24.482934', '91.777417', 0],
            [53, 7, 'Sunamganj', 'সুনামগঞ্জ', '25.0658042', '91.3950115', 0],
            [54, 7, 'Sylhet', 'সিলেট', '24.8897956', '91.8697894', 0],
            [55, 4, 'Bagerhat', 'বাগেরহাট', '22.651568', '89.785938', 0],
            [56, 4, 'Chuadanga', 'চুয়াডাঙ্গা', '23.6401961', '88.841841', 0],
            [57, 4, 'Jashore', 'যশোর', '23.16643', '89.2081126', 0],
            [58, 4, 'Jhenaidah', 'ঝিনাইদহ', '23.5448176', '89.1539213', 0],
            [59, 4, 'Khulna', 'খুলনা', '22.815774', '89.568679', 0],
            [60, 4, 'Kushtia', 'কুষ্টিয়া', '23.901258', '89.120482', 0],
            [61, 4, 'Magura', 'মাগুরা', '23.487337', '89.419956', 0],
            [62, 4, 'Meherpur', 'মেহেরপুর', '23.762213', '88.631821', 0],
            [63, 4, 'Narail', 'নড়াইল', '23.172534', '89.512672', 0],
            [64, 4, 'Satkhira', 'সাতক্ষীরা', '22.7185', '89.0705', 0],
        ];

        foreach ($districts as $district) {
            District::create([
                'id' => $district[0],
                'division_id' => $district[1],
                'name' => $district[2],
                'bn_name' => $district[3],
                'lat' => $district[4],
                'long' => $district[5],
                'zone_charge' => $district[6],
            ]);
        }
    }
}
